/**
 * 小程序配置文件
 */

// 此处主机域名修改成腾讯云解决方案分配的域名
var host = 'https://rkw5l4op.qcloud.la/';

var config = {

    // 下面的地址配合云端 Demo 工作
    service: {
        host,

        // 登录地址，用于建立会话
        loginUrl: `${host}/weapp/login`,

        // 测试的请求地址，用于测试会话
        requestUrl: `${host}/weapp/user`,

        // 测试的信道服务地址
        tunnelUrl: `${host}/weapp/tunnel`,

        // 上传图片接口
        uploadUrl: `${host}/weapp/upload`
    },
    wokeNo:{
        workPhase:'{"0101":"开发-计划阶段","0102":"开发-需求分析阶段","0103":"开发-概要设计阶段","0104":"开发-详细设计阶段","0106":"开发-编码阶段","0108":"开发-单元测试阶段","0109":"开发-集成测试阶段","0110":"开发-系统测试阶段","0111":"开发-验收测试阶段","0113":"开发-用户文档阶段","0114":"开发-交付","0112":"开发-配置管理","0105":"开发-环境安装管理","0201":"市场-客户联络","0202":"市场-硬件采购","0203":"市场-培训和资料收集","0204":"市场-市场项目管理","0205":"市场-方案","0115":"开发-其他"}',
        active:'{"0101":[{"010101": "计划编制"}, {"010102": "计划评审"}, {"010104": "计划跟踪管理"}],"0102":[{"010201": "需求规格编制"}, {"010202": "需求规格评审"}, {"010204": "需求管理"}],"0103":[{"010301": "概要设计编制"}, {"010302": "概要设计评审"}],"0104":[{"010401": "详细设计编制"}, {"010402": "详细设计评审"}],"0106":[{"010601": "代码编制"}, {"010603": "代码评审"}, {"010602": "代码变更对应"}],"0108":[{"010805": "单元测试用例编制"}, {"010806": "单元测试用例评审"}, {"010808": "单元测试实施"}],"0109":[{"010905": "集成测试用例编制"}, {"010906": "集成测试用例评审"}, {"010908": "集成测试实施"}],"0110":[{"011005": "系统测试用例编制"}, {"011006": "系统测试用例评审"}, {"011008": "系统测试实施"}],"0111":[{"011105": "验收测试用例编制"}, {"011106": "验收测试用例评审"}, {"011108": "验收测试实施"}],"0113":[{"011301": "用户文档编制"}, {"011302": "用户文档评审"}],"0114":[{"011301": "交付和部署"}],"0201":[{"020102": "客户联络"}, {"020101": "拜访客户"}, {"020103": "接待客户来访"}],"0202":[{"020201": "采购"}, {"020202": "系统集成"}],"0203":[{"020301": "培训"}, {"020302": "资料收集"}],"0204":[{"020401": "项目会议"}, {"020402": "其它"}],"0205":[{"020501": "编写"}, {"020502": "审核"}, {"020503": "提交"}],"0206" :[{"020601": "休假"}, {"020602": "事假"}, {"020603": "病假"}],"0115":[{"011504": "其他"}],"0301":[{"030101": "行政会议"}, {"030102": "日常管理"}, {"030103": "人员沟通"}, {"030104": "行业合作"}],"0302":[{"030201": "人事资料整理"}, {"030202": "面试"}, {"030203": "日常工作办理"}, {"030204": "考评管理"}, {"030205": "招聘材料查阅"}],"0303":[{"030301": "会计事务"}, {"030302": "出纳事务"}],"0304":[{"030401": "仓库管理"}, {"030402": "光盘、图书管理"}, {"030403": "采购"}],"0305":[{"030501": "培训"}, {"030502": "资料收集整理"}],"0306":[{"030601": "其它工作"}, {"030602": "公司IT维护"}, {"030603": "技术调查"}],"0401":[{"040101": "休息"}],"0402":[{"040201": "交流"}],"0403":[{"040301": "休假"}, {"040302": "病假"}, {"040303": "婚假"}, {"040304": "事假"}],"0404":[{"040401": "其它"}, {"040402": "等待"}],"0405":[{"040501": "客户联络"}, {"040502": "客户拜访"}, {"040503": "客户接待"}, {"040504": "客户交流"}],"0407":[{   "040701": "争议日志"}]}',

    }
};

module.exports = config;
